Llerr/Clock-on-STM32/Core/Src/Screens.c
#include <stdio.h>

#include "stm32_ub_font.h"
#include "MatrixRGB.h"
#include "sensors.h"
#include "buttons.h"
#include "rtc.h"
#include "backup.h"
#include "utils.h"
#include "audio.h"
#include "bmp280.h"
#include "aht10.h"

#include "Screens.h"
#include "pictures.h"

#define NUM_MAIN_SCREENS 4
#define SLEEP_TIME (10*60)
#define BELL_TIME_OFF (15*60)

int brightCur = 255; ///< Текущая яркость
uint8_t useCountdown = 0;
uint8_t counterForScreens = 0; ///< счётчик для перехода к следующему экрану
uint8_t resetCounter = 0;      ///< Счётчик для перехода к начальному режиму (Отображение времени)

int32_t bellTimeOff = -1;

//int menu = 0;  ///<  Пункт меню
char editMode = 0; ///< Флаг редактирования
char editText[32] = {0};
char editTextDays[32] = {0};
char editTextOffDays[32] = {0};
char editTextAlarmOn[32] = {0};
char blinkText[32] = {0};

ScreenDescript *screenCur = NULL;
ScreenDescript *screenPrev = NULL;

char *weekText[]=
{
    "    Sunday ",
    "    Monday ",
    "  Tuesday ",
    "Wednesday",
    "  Thursday",
    "    Friday ",
    "   Saturday",
};


//Понедельник - Monday - Mon или Mo
//Вторник - Tuesday - Tue или Tu
//Среда - Wednesday - Wed или We
//Четверг - Thursday - Thu или Th
//Пятница - Friday - Fri или Fr
//Суббота - Saturday - Sat или Sa
//Воскресенье - Sunday - Sun или Su


char *menuText[] =
{
    "Time        ",
    "Date        ",
    "Alarms >    ",
    "Brightness >"
};

//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
void drawScreen()
{
  if(!screenCur)
    return;
  //  clearMatrix();
  for(int i = 0; i < screenCur->numText; ++i)
  {
    screenCur->text[i]->draw(screenCur->text[i], NULL);
  }
  //  blink(0); // перересуем соответствующим цветом, то что должно мигать
}

//----------------------------------------------------------------------------------------------------------------------
void screenSecondCallback()
{
  if(useCountdown)
  {
    if(decreaseTime(&sCountdown))
    {
      clearScreen();
      screenCur = &screenCountdownFinish;
      useCountdown = 0;
      playSound(&countDownSound, 1);
    }

    return; // Дальше можно ничего не делать
  }

  if(counterForScreens > 3)
  {
    counterForScreens = 0;
    nextScreenMode();
  }
  ++counterForScreens;
  checkAlarms();
}

//----------------------------------------------------------------------------------------------------------------------
void clearScreen()
{
  clearMatrix();
}

//----------------------------------------------------------------------------------------------------------------------
void nextScreenMode()
{
  //  printf("Next main screen: cur: %p, next: %p\n", screenCur, screenCur->nextMode);
//  static uint8_t resetCounter = 0;
  switch(screenCur->type)
  {
  // В основном режиме, листаем показания
  case stateTime:
    screenCur = screenCur->nextMode;
    break;
  // В режимах редактирования, ничего не делаем, а так же в экранах будильника
  case stateClock:
  case stateSleep:
  case stateAlarmEdit:
  case stateBrightnessEdit:
  case stateCountDownFinish:
  case stateCountDownEdit:
  case stateDateEdtit:
  case stateTimeEdit:
    break;
  // По умолчанию, возвращаемся к показу времени
  default:
    if(++resetCounter > 3)
    {
      clearScreen();
      resetCounter = 0;
      screenCur = &screenMain1;
    }
    break;
  }
}

//----------------------------------------------------------------------------------------------------------------------
void blink(uint8_t change)
{
  if(!screenCur->blink) // Если нет мигания
    return;
  static uint8_t blinkStep = 0;
  static uint8_t color;
  if(change)
  {
    color = (!blinkStep)?screenCur->blink->colorFont:screenCur->blink->colorBack;
    blinkStep = !blinkStep;
  }
  //  screenCur->blink->colorFont = color;
//    printf("%lu: Blink, color( %d ) \n", HAL_GetTick(), color);
  screenCur->blink->draw(screenCur->blink, &color);
}


//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
//----------------------------------------------------------------------------------------------------------------------
void sleepOn()
{
  printf("Sleep On\n");
  screenCur = &screenSleep; // Переключимся на экран сна
  alarmSetState(&alarmSleep, 1); //включим сон
  bellTimeOff = -1;
  stopSound();
}

//----------------------------------------------------------------------------------------------------------------------
void alarmOff()
{
  printf("Alarm Off\n");
  screenCur = &screenMain1; // Переключимся на основное время
  alarmSetState(&alarmSleep, 0); //отключим сон
  bellTimeOff = -1;
  stopSound();
}

//----------------------------------------------------------------------------------------------------------------------
void alarmOn(Alarm *alrm)
{
  printf("Alarm On\n");
  screenCur = &screenClock;
  alarmSleep.alarmTime = alrm->alarmTime;
  addTime(&alarmSleep.alarmTime, SLEEP_TIME);
  bellTimeOff = BELL_TIME_OFF;
  playSound(&clockSound, 1);
  clearScreen();
}

//----------------------------------------------------------------------------------------------------------------------
void checkAlarms()
{
//  printf("time %02d:%02d:%02d\n", sTime.Hours, sTime.Minutes, sTime.Seconds);
//
//  printf("alrm1 %02d:%02d:%02d %d\n", alarm1.alarmTime.Hours,
//      alarm1.alarmTime.Minutes, alarm1.alarmTime.Seconds, alarm1.on);
  if(alaramIsOn(&alarm1))
  {
    alarmOn(&alarm1);
  }
  if(alaramIsOn(&alarm2))
  {
    alarmOn(&alarm2);
  }
  if(alaramIsOn(&alarm3))
  {
    alarmOn(&alarm3);
  }
  if(alaramIsOn(&alarmSleep))
  {
    alarmOn(&alarmSleep);
  }

  if(bellTimeOff > 0) // Через BELL_TIME_OFF выключить звонок
  {
    --bellTimeOff;
//    printf("Bell sing %ld sec\n", bellTimeOff);
  }
  else if(0 == bellTimeOff)
  {
    alarmOff();
  }
}

//----------------------------------------------------------------------------------------------------------------------
void setBrightness()
{

