Llerr/Clock-on-STM32/Core/Src/Screens.c
TextSets textHour        = {txtTime,        1,     -5,  WHITE,  BLACK, &pDigital_7_28, drawHour,         NULL}; // Время
TextSets textMinute      = {txtTime,        27+4,  -5,  WHITE,  BLACK, &pDigital_7_28, drawMinute,       NULL}; // Время
TextSets textBellOn      = {txtTime,        57,    1,   WHITE,  BLACK, &pDigital_7_28, drawBellOn,       NULL}; // Время
TextSets textDateAdd     = {txtDate,        0,     19,  YELLOW, BLACK, &pArial_13,     drawDateAdd,      NULL}; // Дата дополнительным полем
TextSets textTemperature = {txtTemperature, 0,     19,  YELLOW, BLACK, &pArial_13,     drawTemperature,  NULL}; // температура
TextSets textHumidity    = {txtHumidity,    0,     19,  YELLOW, BLACK, &pArial_13,     drawHumidity,     NULL}; // Влажность
TextSets textPressure    = {txtPressure,    0,     19,  YELLOW, BLACK, &pArial_13,     drawPressure,     NULL}; // Давление
TextSets textClock       = {txtClock,       18,    19,  YELLOW, BLACK, &pArial_13,     drawClock,        NULL}; // Будильник
TextSets textSleep       = {txtSleep,       20,    19,  YELLOW, BLACK, &pArial_13,     drawSleep,        NULL}; // Досыпание

TextSets textDate        = {txtTimer,       0,     0,  WHITE, BLACK, &pTimes_18,     drawDate,         NULL}; // Дата
TextSets textWeekDay     = {txtTimer,       1,    18, YELLOW, BLACK, &pArial_13,     drawWeekDay,      NULL}; // День недели

TextSets textAlarm            = {txtTime,        0,       -5, WHITE,  BLACK, &pDigital_7_28, drawAlarm,         NULL}; // Время
TextSets textAlarmDays        = {txtAlarmDays,   0,       23, YELLOW, BLACK, &Arial_7x10,    drawAlarmDays,     NULL}; // Список дней недели
TextSets textAlarmOffDays     = {txtAlarmDays,   0+7*5,   23, YELLOW, BLACK, &Arial_7x10,    drawAlarmOffDays,  NULL}; // Список дней недели
TextSets textAlarmOn          = {txtAlarmDays,   0+7*7+1, 23, YELLOW, BLACK, &Arial_7x10,    drawAlarmOn,       NULL}; // Список дней недели
TextSets textAlarmDaysEdit    = {txtAlarmDays,   0,       23, YELLOW, BLACK, &Arial_7x10,    drawEdit,          editTextDays}; // Список дней недели для редактирования
TextSets textAlarmOffDaysEdit = {txtAlarmDays,   0,       23, YELLOW, BLACK, &Arial_7x10,    drawEdit,          editTextOffDays}; // Список дней недели для редактирования
TextSets textAlarmOnEdit      = {txtAlarmDays,   0,       23, YELLOW, BLACK, &Arial_7x10,    drawEdit,          editTextAlarmOn}; // Список дней недели для редактирования
TextSets textBlinkDays        = {txtAlarmDays,   0,       23, GREEN,  BLACK, &Arial_7x10,    drawBlink,         blinkText}; // Рабочий день недели, для мигания
TextSets textBlinkOffDays     = {txtAlarmDays,   0+7*5,   23, RED,    BLACK, &Arial_7x10,    drawBlink,         blinkText}; // Выходной день недели, для мигания
TextSets textBlinkAlarmOn     = {txtAlarmDays,   0+7*7+1, 23, WHITE,  BLACK, &Arial_7x10,    drawBlink,         blinkText}; // Одиночный будильник, для мигания

TextSets textTimer       = {txtTimer,       0,     0, YELLOW, BLACK, &pComic_16,     drawTimer,        NULL};
TextSets textCountDown   = {txtCountdown,   0,     0, YELLOW, BLACK, &pTimes_18,     drawCountdown,    NULL};
TextSets textBrightness  = {txtBrightness, 16,     0, YELLOW, BLACK, &pTimes_18,     drawBrightness,   NULL}; // Яркость экрана
TextSets textIllum       = {txtIllum,      16,    16,    RED, BLACK, &pComic_16,     drawIllumination, NULL}; // Внешняя освещённость

TextSets textCntDownInf     = {txtCountdownInfo,   2, 19,    WHITE, BLACK, &pArial_13,     drawText,    "Countdown"}; // Пояснительная надпись
TextSets textCntDownFinish  = {txtCountdownFinish, 2, 17,      RED, BLACK, &pTimes_18,     drawBlink32,    "FINISH"}; // надпись о завершении отсчёта

/// Пункты меню, выделенные и нет.
TextSets textMenuTime      = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Time       "};
TextSets textMenuTimeSel   = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Time       "};
TextSets textMenuDate      = {txtMenu,    0, 11, GREEN, BLACK,       &pArial_13, drawMenu, "Date       "};
TextSets textMenuDateSel   = {txtMenuSel, 0, 11, WHITE, BLACK,       &pArial_13, drawMenu, "Date       "};
TextSets textMenuAlr       = {txtMenu,    0, 22, GREEN, BLACK,       &pArial_13, drawMenu, "Alarms >   "};
TextSets textMenuAlrSel    = {txtMenuSel, 0, 22, WHITE, BLACK,       &pArial_13, drawMenu, "Alarms >   "};
TextSets textMenuBright    = {txtMenu,    0, 0,  GREEN, BLACK,       &pArial_13, drawMenu, "Brightness "};
TextSets textMenuBrightSel = {txtMenuSel, 0, 0,  WHITE, BLACK,       &pArial_13, drawMenu, "Brightness "};
TextSets textMenuDebug     = {txtMenu,    0, 11, GREEN, TRANSPARENT, &pArial_13, drawMenu, "Debug >"};
TextSets textMenuDebugSel  = {txtMenuSel, 0, 11, WHITE, TRANSPARENT, &pArial_13, drawMenu, "Debug >"};

TextSets textDebugAHT10    = {txtAHT10, 0, 0,   WHITE, BLACK, &pArial_13, drawAHT10, "AHT10"};

TextSets textDebugBMP280   = {txtBMP280, 0, 0,   WHITE, BLACK, &pArial_13, drawBMP280, "BMP280"};

//TextSets textMenuAlrm0    = {txtMenu,    0, 0,  GREEN, BLACK, &pArial_13, drawMenu, "Alarm 1     "};
//TextSets textMenuAlrm0Sel = {txtMenuSel, 0, 0,  WHITE, BLACK, &pArial_13, drawMenu, "Alarm 1     "};
//TextSets textMenuAlrm1    = {txtMenu,    0, 11, GREEN, BLACK, &pArial_13, drawMenu, "Alarm 2     "};
//TextSets textMenuAlrm1Sel = {txtMenuSel, 0, 11, WHITE, BLACK, &pArial_13, drawMenu, "Alarm 2     "};
//TextSets textMenuAlrm2    = {txtMenu,    0, 22, GREEN, BLACK, &pArial_13, drawMenu, "Alarm 3     "};
//TextSets textMenuAlrm2Sel = {txtMenuSel, 0, 22, WHITE, BLACK, &pArial_13, drawMenu, "Alarm 3     "};


TextSets textTimeEdit      = {txtTimeEdit, 1, -5, WHITE,  BLACK, &pDigital_7_28, drawEdit,  editText};  // Текст для редактирования
TextSets textBlinkTimeEdit = {txtTimeEdit, 1, -5, WHITE,  BLACK, &pDigital_7_28, drawBlink, blinkText}; // Время

TextSets textEditBright32   = {txtEditBright32,  16, 0,  YELLOW, BLACK, &pTimes_18, drawEdit32,    editText};
TextSets textEdit32         = {txtEdit32,         0, 0,  YELLOW, BLACK, &pTimes_18, drawEdit32,    editText};
TextSets textBlink32        = {txtBlink32,        0, 0,  YELLOW, BLACK, &pTimes_18, drawBlink32,   blinkText};


//TextSets *texts = {textTime, textTemperature};
//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMain1 =
{
    stateTime,
    &textBlinkTime,

    &screenMain2,      // следующий экран режима
    &screenMain4,
    &screenDate,
    &screenBrightness,
    &screenMain1,

    &screenMenuTime, // кнопка set

