Llerr/Clock-on-STM32/Core/Src/Screens.c
    midStub,      // Краткое нажатие
    selectMenuTime,
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textHour, &textMinute, &textTemperature, &textBellOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMain2 =
{
    stateTime,
    &textBlinkTime, //blink

    &screenMain3,    // следующий экран режима
    &screenMain1,
    &screenDate,
    &screenBrightness,
    &screenMain2,

    &screenMenuTime, // кнопка set

    midStub,      // Краткое нажатие
    selectMenuTime,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textHour, &textMinute, &textHumidity, &textBellOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMain3 =
{
    stateTime,
    &textBlinkTime, //Текст для мигания

    &screenMain4,    // следующий экран режима
    &screenMain2,
    &screenDate,
    &screenBrightness,
    &screenMain3,

    &screenMenuTime, // кнопка set

    midStub,      // Краткое нажатие
    selectMenuTime,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textHour, &textMinute, &textPressure, &textBellOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMain4 =
{
    stateTime,
    &textBlinkTime, //blink

//    &screenClock, // Лево
    &screenMain1, // Лево
    &screenMain3, // Право
    &screenDate,
    &screenBrightness,
    &screenMain4,

    &screenMenuTime, // кнопка set

    midStub,      // Краткое нажатие
    selectMenuTime,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textHour, &textMinute, &textDateAdd, &textBellOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenClock =
{
    stateClock,
    &textBlinkTime, //blink

    &screenClock, // Лево
    &screenClock, // Право
    &screenClock,
    &screenClock,
    &screenClock,

    &screenClock, // кнопка set

    sleepOn,      // Краткое нажатие
    alarmOff,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textHour, &textMinute, &textClock}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenSleep =
{
    stateSleep,
    &textBlinkTime, //blink

    &screenSleep, // Лево
    &screenSleep, // Право
    &screenSleep,
    &screenSleep,
    &screenSleep,

    &screenSleep, // кнопка set

    midStub,      // Краткое нажатие
    alarmOff,     // Длинное нажатие
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textHour, &textMinute, &textSleep}
};

//----------------------------------------------------------------------------------------------------------------------
//ScreenDescript screenTimer =
//{
//    stateTimer,
//    NULL, //blink
//
//    &screenTimer,     // следующий экран режима
//    &screenTimer,
//    &screenCountdown,
//    &screenMain1,
//    &screenMain1,

//    &screenMenuTime, // кнопка set

//    midStub,            // Краткое нажатие
//    timerStartStop,     // Длинное нажатие
//    buttonReceiverMenu, // Обработчик кнопок в этом пункте
//    1,
//    {&textTimer}
//};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenDate =
{
    stateCountDown,
    NULL, //blink

    &screenDate,       // следующий экран режима
    &screenDate,       // предыдущий экран режима
    &screenCountdown,  // следующий режим
    &screenMain1,      // предыдущий режим
    &screenMain1,

    &screenMenuTime,   // кнопка set

    midStub,           // Краткое нажатие средней кнопки
    selectMenuDate,           // Длинное нажатие средней кнопки

    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textDate, &textWeekDay}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenCountdown =
{
    stateCountDown,
    NULL, //blink

    &screenCountdown,   // следующий экран режима
    &screenCountdown,   // предыдущий экран режима
    &screenBrightness,  // следующий режим
    &screenDate,       // предыдущий режим
    &screenMain1,

    &screenMenuTime, // кнопка set

    countdownStartStop,   // Краткое нажатие средней кнопки
    inCountdownEdit,              // Длинное нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textCountDown, &textCntDownInf}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenCountdownFinish =
{
    stateCountDownFinish,
    &textCntDownFinish, //blink

    &screenCountdown,   // следующий экран режима
    &screenCountdown,   // предыдущий экран режима
    &screenCountdown,   // следующий режим
    &screenCountdown,   // предыдущий режим
    &screenMain1,

    &screenMenuTime, // кнопка set

    countdownFinish,   // Краткое нажатие средней кнопки
    inCountdownEdit,              // Длинное нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    1,
    {&textCountDown}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenCountdownEdit =
{
    stateCountDownEdit,
    &textBlink32, //blink

    &screenCountdownEdit,  // следующий экран режима
    &screenCountdownEdit,  // предыдущий экран режима
    &screenCountdownEdit,  // следующий режим
    &screenCountdownEdit,  // предыдущий режим
    &screenMain1,

    &screenCountdownEdit, // кнопка set

    saveCountdown,               // Краткое нажатие средней кнопки
    midStub,                     // Длинное нажатие средней кнопки
    buttonReceiverCountdownEdit, // Обработчик кнопок в этом пункте
    2,
    {&textEdit32, &textCntDownInf}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenBrightness =
{
    stateBrightness,
    NULL, //blink

    &screenBrightness,  // следующий экран режима
    &screenBrightness,  // предыдущий экран режима
    &screenMain1,       // следующий режим
    &screenCountdown,   // предыдущий режим
    &screenMain1,       // режим, при долгом нажатии влево. (выход из меню, из редактирования)

    &screenMenuTime, // кнопка set

    midStub,            // Краткое нажатие средней кнопки
    inBrightness,       // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textBrightness, &textIllum}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenBrightnessEdit =
{
    stateBrightnessEdit,
    &textBlink32, //blink

    &screenBrightnessEdit,    // следующий экран режима
    &screenBrightnessEdit,    // предыдущий экран режима
    &screenBrightnessEdit,    // следующий режим
    &screenBrightnessEdit,    // предыдущий режим
    &screenBrightness,        // режим, при долгом нажатии влево. (выход из меню, из редактирования)

    &screenBrightnessEdit, // кнопка set (В режиме редактирования не используется)

