Llerr/Clock-on-STM32/Core/Src/Screens.c
    saveBrightness,           // Краткое нажатие средней кнопки
    showMenu,                 // Долгое нажатие средней кнопки
    buttonReceiverBrightEdit, // Обработчик кнопок в этом пункте
    2,
    {&textEditBright32, &textIllum}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuTime =
{
    stateMenuTime,
    NULL, //blink

    &screenMenuTime,  // Право
    &screenMain1,  // Лево
    &screenMenuTime,  // вверх
    &screenMenuDate,  // вниз
    &screenMain1,  // Долгое нажатие влево

    &screenMain1, // кнопка set

    selectMenuTime,      // Краткое нажатие центр
    midStub,             // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textMenuTimeSel, &textMenuDate, &textMenuAlr}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuDate =
{
    stateMenuDate,
    NULL, //blink

    &screenMenuDate,  // Право
    &screenMenuDate,  // Лево
    &screenMenuTime,  // вверх
    &screenMenuAlarm, // вниз
    &screenMain1,

    &screenMain1, // кнопка set

    selectMenuDate,   // Краткое нажатие средней кнопки
    midStub,          // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textMenuTime, &textMenuDateSel, &textMenuAlr}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlarm =
{
    stateMenuAlarm,
    NULL, //blink

    &screenMenuAlr0,      // Право
    &screenMenuAlarm,     // Лево
    &screenMenuDate,      // вверх
    &screenMenuBrightness,// вниз
    &screenMain1,

    &screenMain1, // кнопка set

    midStub,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    3,
    {&textMenuTime, &textMenuDate, &textMenuAlrSel}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuBrightness =
{
    stateMenuBrightness,
    NULL, //blink

    &screenMenuBrightness,  // Право
    &screenMenuBrightness,  // Лево
    &screenMenuAlarm,       // вверх
    &screenMenuDebug,  // вниз
    &screenMain1,       //Долгое нажатие влево

    &screenMain1, // кнопка set

    inBrightness,      // Краткое нажатие средней кнопки
    midStub,           // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textMenuBrightSel, &textMenuDebug}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlr0 =
{
    stateMenuAlarm1,
    NULL, //blink

    &screenMenuAlr0,    // Право
    &screenMenuAlarm,   // Лево
    &screenMenuAlr0,    // вверх
    &screenMenuAlr1,    // вниз
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,     // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlr1 =
{
    stateMenuAlarm2,
    NULL, //blink

    &screenMenuAlr1,    // Право
    &screenMenuAlarm,   // Лево
    &screenMenuAlr0,    // вверх
    &screenMenuAlr2,    // вниз
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuAlr2 =
{
    stateMenuAlarm3,
    NULL, //blink

    &screenMenuAlr2,   // Право
    &screenMenuAlarm,  // Лево
    &screenMenuAlr1,   // вверх
    &screenMenuAlr2,   // вниз
    &screenMenuAlarm,

    &screenMain1, // кнопка set

    selectMenuAlarm,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    4,
    {&textAlarm, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuDebug =
{
    stateMenuBrightness,
    NULL, //blink

    &screenMenuDebugAHT10,      // Право
    &screenMenuDebug,      // Лево
    &screenMenuBrightness, // вверх
    &screenMenuDebug,      // вниз
    &screenMain1,          //Долгое нажатие влево

    &screenMain1, // кнопка set

    inBrightness,      // Краткое нажатие средней кнопки
    midStub,           // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    2,
    {&textMenuBright, &textMenuDebugSel}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuDebugAHT10 =
{
    stateMenuBrightness,
    NULL, //blink

    &screenMenuDebugAHT10,  // Право
    &screenMenuDebug,       // Лево
    &screenMenuDebugAHT10,  // вверх
    &screenMenuDebugBMP280,      // вниз
    &screenMain1,          //Долгое нажатие влево

    &screenMain1, // кнопка set

    midStub,           // Краткое нажатие средней кнопки
    midStub,           // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    1,
    {&textDebugAHT10}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenMenuDebugBMP280 =
{
    stateMenuBrightness,
    NULL, //blink

    &screenMenuDebugBMP280,  // Право
    &screenMenuDebug,        // Лево
    &screenMenuDebugAHT10,   // вверх
    &screenMenuDebugBMP280,  // вниз
    &screenMain1,            //Долгое нажатие влево

