Llerr/Clock-on-STM32/Core/Src/Screens.c
    &screenMain1, // кнопка set

    midStub,      // Краткое нажатие средней кнопки
    midStub,           // Долгое нажатие средней кнопки
    buttonReceiverMenu, // Обработчик кнопок в этом пункте
    1,
    {&textDebugBMP280}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenEditTime =
{
    stateTimeEdit,
    &textBlinkTimeEdit, //blink

    &screenEditTime,   // Право
    &screenEditTime,   // Лево
    &screenEditTime,   // вверх
    &screenEditTime,   // вниз
    &screenMenuTime,

    &screenEditTime, // кнопка set (В режиме редактирования не используется)

    saveTime,      // Краткое нажатие средней кнопки
    midStub,        // Долгое нажатие средней кнопки
    buttonReceiverTimeEdit, // Обработчик кнопок в этом пункте
    1,
    {&textTimeEdit}
};


//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenEditAlarm =
{
    stateAlarmEdit,
    &textBlinkTimeEdit, //blink

    &screenEditAlarm,    // Право
    &screenEditAlarm,    // Лево
    &screenEditAlarm,    // вверх
    &screenEditAlarm,    // вниз
    &screenMenuAlr0,

    &screenEditAlarm, // кнопка set (В режиме редактирования не используется)

    saveAlarm,      // Краткое нажатие средней кнопки
    midStub,        // Долгое нажатие средней кнопки
    buttonReceiverAlarmEdit, // Обработчик кнопок в этом пункте
    4,
    {&textTimeEdit, &textAlarmDays, &textAlarmOffDays, &textAlarmOn}
};

//----------------------------------------------------------------------------------------------------------------------
ScreenDescript screenEditDate =
{
    stateDateEdtit,
    &textBlink32, //blink

    &screenEditDate,  // Право
    &screenEditDate,  // Лево
    &screenEditDate,  // вверх
    &screenEditDate,  // вниз
    &screenMenuTime,

    &screenMenuTime, // кнопка set

    saveDate,      // Краткое нажатие средней кнопки
    midStub,      // Долгое нажатие средней кнопки
    buttonReceiverDateEdit, // Обработчик кнопок в этом пункте
    1,
    {&textEdit32}
};

